In [1]:
import os
import numpy as np
import pandas as pd
from lsst.sims.maf.db import ResultsDb
from IPython.display import display, HTML

In [2]:
newruns = ['minion_1016',
           'astro_lsst_01_1016',
           'astro_lsst_01_1015',
           'astro_lsst_01_1017']
oldruns = ['enigma_1189', 'enigma_1281', 'enigma_1282', 'minion_1016']

In [3]:
pha_new = {}
neo_new = {}
for r in newruns:
    pha_new[r] = ResultsDb(os.path.join('opsimfiles', r, 'phas_2k_newsky'))
    neo_new[r] = ResultsDb(os.path.join('opsimfiles', r, 'neo_newsky'))

In [4]:
pha_old = {}
neo_old = {}
for r in oldruns:
    pha_old[r] = ResultsDb(os.path.join('opsimfiles', r, 'pha'))
    neo_old[r] = ResultsDb(os.path.join('opsimfiles', r, 'neo'))

In [5]:
def make_dataframe(runs, runlist, metricName='CumulativeCompleteness'):
    summary = []
    for r in runlist:
        mId = runs[r].getMetricId(metricName)
        s = runs[r].getSummaryStats(mId, summaryName=None)
        summary.append(pd.DataFrame(zip(s['metricMetadata'], s['summaryValue']*100.0), columns=['metadata', r]))
    df = summary[0]
    for i in range(1, len(summary)):
        df = pd.merge(df, summary[i], how='outer', on='metadata')
    return df

In [6]:
pha_new_df = make_dataframe(pha_new, newruns)
pha_old_df = make_dataframe(pha_old, oldruns)
neo_new_df = make_dataframe(neo_new, newruns)
neo_old_df = make_dataframe(neo_old, oldruns)

In [7]:
neo_new_df

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
0,NEO 3 pairs in 15 nights trailing loss yr 1,13.900172,12.955354,15.032470,18.805924
1,NEO 3 pairs in 15 nights trailing loss yr 10,61.523994,61.778417,59.553554,63.685060
2,NEO 3 pairs in 15 nights trailing loss yr 2,26.701276,26.092336,25.540026,31.143039
3,NEO 3 pairs in 15 nights trailing loss yr 4,42.489774,42.212217,40.709469,46.125108
4,NEO 3 pairs in 15 nights trailing loss yr 6,50.702552,51.008305,48.917588,53.509184
5,NEO 3 pairs in 15 nights trailing loss yr 8,56.928903,57.268185,54.841604,59.154006
6,NEO 3 pairs in 15 nights yr 1,13.747707,12.927347,14.624236,18.429976
7,NEO 3 pairs in 15 nights yr 10,60.655279,60.843423,57.718595,62.424450
8,NEO 3 pairs in 15 nights yr 2,26.272729,25.729240,24.787035,30.685531
9,NEO 3 pairs in 15 nights yr 4,41.847818,41.503764,39.424543,45.196169
10,NEO 3 pairs in 15 nights yr 6,49.932373,50.157038,47.245888,52.343839
11,NEO 3 pairs in 15 nights yr 8,56.136758,56.318698,53.172302,57.962037
12,"NEO 3 pairs in 15 nights, SNR=0 yr 1",53.726863,52.576288,56.028014,56.228114
13,"NEO 3 pairs in 15 nights, SNR=0 yr 10",90.595298,91.245623,92.546273,91.345673
14,"NEO 3 pairs in 15 nights, SNR=0 yr 2",76.538269,76.888444,77.488744,76.638319
15,"NEO 3 pairs in 15 nights, SNR=0 yr 4",85.892946,86.493247,87.443722,86.093047
16,"NEO 3 pairs in 15 nights, SNR=0 yr 6",88.594297,89.144572,90.045023,88.594297
17,"NEO 3 pairs in 15 nights, SNR=0 yr 8",89.694847,90.395198,91.495748,90.445223
18,"NEO 3 pairs in 15 nights, SNR=3 yr 1",17.397215,16.065081,18.595986,22.753541
19,"NEO 3 pairs in 15 nights, SNR=3 yr 10",68.358074,68.741771,66.732872,69.810081
20,"NEO 3 pairs in 15 nights, SNR=3 yr 2",32.455648,31.568596,30.892959,37.007922
21,"NEO 3 pairs in 15 nights, SNR=3 yr 4",49.547923,49.225380,47.914081,52.916617
22,"NEO 3 pairs in 15 nights, SNR=3 yr 6",58.069497,58.390858,56.364700,60.358514
23,"NEO 3 pairs in 15 nights, SNR=3 yr 8",64.073964,64.550428,62.281536,65.789320
24,"NEO 3 pairs in 15 nights, SNR=4 yr 1",15.412255,14.339902,16.449393,20.364904
25,"NEO 3 pairs in 15 nights, SNR=4 yr 10",64.779649,64.960576,62.161525,66.101108
26,"NEO 3 pairs in 15 nights, SNR=4 yr 2",29.140608,28.425714,27.725208,33.569102
27,"NEO 3 pairs in 15 nights, SNR=4 yr 4",45.683407,45.326169,43.573654,48.865775
28,"NEO 3 pairs in 15 nights, SNR=4 yr 6",53.977121,54.248901,51.772165,56.296627
29,"NEO 3 pairs in 15 nights, SNR=4 yr 8",60.278259,60.521140,57.537166,61.887136
...,...,...,...,...,...
213,NEO 6 detections in 60 nights yr 12,NaN,80.661464,81.012437,81.789599
214,NEO 6 detections in 60 nights yr 14,NaN,82.850595,82.947658,83.415714
215,NEO 6 detections in 60 nights yr 15,NaN,83.768776,83.454651,84.053899
216,NEO High velocity pair yr 12,NaN,39.704028,58.806990,58.278503
217,NEO High velocity pair yr 14,NaN,42.937901,62.959117,62.415872
218,NEO High velocity pair yr 15,NaN,44.130943,64.408850,64.168548
219,NEO Single detection yr 12,NaN,82.489749,83.469215,83.627334
220,NEO Single detection yr 14,NaN,84.814636,85.591802,85.570382
221,NEO Single detection yr 15,NaN,85.606402,86.360225,86.288912
222,NEO Single pair yr 12,NaN,78.016357,79.172261,79.591646
223,NEO Single pair yr 14,NaN,80.603021,81.487043,81.982648
224,NEO Single pair yr 15,NaN,81.520661,82.398401,82.918050
225,"NEO 3 quads in 30 nights, SNR=3 yr 12",NaN,NaN,36.202875,46.636781
226,"NEO 3 quads in 30 nights, SNR=3 yr 14",NaN,NaN,39.347658,49.191983
227,"NEO 3 quads in 30 nights, SNR=3 yr 15",NaN,NaN,40.221417,50.464549
228,"NEO 3 quads in 30 nights, SNR=4 yr 12",NaN,NaN,32.669406,42.685950
229,"NEO 3 quads in 30 nights, SNR=4 yr 14",NaN,NaN,35.602698,45.151473
230,"NEO 3 quads in 30 nights, SNR=4 yr 15",NaN,NaN,36.469481,46.444414
231,"NEO 3 triplets in 30 nights, SNR=3 yr 12",NaN,NaN,47.852295,56.548143
232,"NEO 3 triplets in 30 nights, SNR=3 yr 14",NaN,NaN,51.002864,58.995742
233,"NEO 3 triplets in 30 nights, SNR=3 yr 15",NaN,NaN,52.095432,60.351659
234,"NEO 3 triplets in 30 nights, SNR=4 yr 12",NaN,NaN,43.558878,52.439070
235,"NEO 3 triplets in 30 nights, SNR=4 yr 14",NaN,NaN,46.652645,54.755387
236,"NEO 3 triplets in 30 nights, SNR=4 yr 15",NaN,NaN,47.787538,56.191463
237,"NEO 4 pairs in 20 nights, SNR=3 yr 12",NaN,NaN,62.511739,68.014103
238,"NEO 4 pairs in 20 nights, SNR=3 yr 14",NaN,NaN,65.617639,70.711204
239,"NEO 4 pairs in 20 nights, SNR=3 yr 15",NaN,NaN,66.958501,71.972903
240,"NEO 4 pairs in 20 nights, SNR=4 yr 12",NaN,NaN,58.121466,64.236565
241,"NEO 4 pairs in 20 nights, SNR=4 yr 14",NaN,NaN,61.468304,67.001886
242,"NEO 4 pairs in 20 nights, SNR=4 yr 15",NaN,NaN,62.842617,68.283089

In [8]:
def show_match(metadata, df):
    display(df[df.metadata.str.contains(metadata)])

In [9]:
def show_diff(metadata1, metadata2, df):
    runnames = list(df.columns.values)
    runnames.remove('metadata')
    d = (df[df.metadata.str.contains(metadata2)][runnames].as_matrix() - 
         df[df.metadata.str.contains(metadata1)][runnames].as_matrix())
    diff = pd.DataFrame(d, columns=runnames)
    diff['average'] = np.nanmean(d)
    print "Going from %s to %s:" % (metadata1, metadata2)
    display(diff)

In [10]:
df = pha_new_df
match1 = '3 pairs in 15 nights yr 10'
show_match(match1, df)
match15 = '3 pairs in 30 nights yr 10'
show_match(match15, df)
show_diff(match1, match15, df)
match2 = '3 pairs in 15 nights yr 12'
show_match(match2, df)
show_diff(match1, match2, df)

match3 = '3 pairs in 30 nights yr 12'
show_match(match3, df)
show_diff(match2, match3, df)

match4 = '3 pairs in 30 nights trailing loss yr 12'
show_match(match4, df)
show_diff(match3, match4, df)

#match5 = '3 pairs in 30 nights trailing loss, SNR=4 yr 12'
match5 = '3 pairs in 30 nights, SNR=4 yr 12'
show_match(match5, df)
show_diff(match4, match5, df)

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
19,PHA 3 pairs in 15 nights yr 10,65.55878,66.108125,63.248324,66.50123

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
61,PHA 3 pairs in 30 nights yr 10,68.362613,69.799107,67.513962,70.287272

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 30 nights yr 10:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,2.803833,3.690982,4.265638,3.786042,3.636624

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
129,PHA 3 pairs in 15 nights yr 12,NaN,70.518929,67.343787,70.150929

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 15 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,4.410805,4.095463,3.649699,4.051989

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
150,PHA 3 pairs in 30 nights yr 12,NaN,73.901843,71.703517,73.788041

Going from 3 pairs in 15 nights yr 12 to 3 pairs in 30 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,3.382914,4.35973,3.637112,3.793252

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
147,PHA 3 pairs in 30 nights trailing loss yr 12,NaN,74.825595,74.495694,75.752236

Going from 3 pairs in 30 nights yr 12 to 3 pairs in 30 nights trailing loss yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,0.923752,2.792177,1.964195,1.893374

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
156,"PHA 3 pairs in 30 nights, SNR=4 yr 12",NaN,77.104934,75.734836,77.1828

Going from 3 pairs in 30 nights trailing loss yr 12 to 3 pairs in 30 nights, SNR=4 yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,2.279339,1.239142,1.430564,1.649682

In [11]:
df = neo_new_df
match1 = '3 pairs in 15 nights yr 10'
show_match(match1, df)
match15 = '3 pairs in 30 nights yr 10'
show_match(match15, df)
show_diff(match1, match15, df)
match2 = '3 pairs in 15 nights yr 12'
show_match(match2, df)
show_diff(match1, match2, df)
match3 = '3 pairs in 30 nights yr 12'
show_match(match3, df)
show_diff(match2, match3, df)
match4 = '3 pairs in 30 nights trailing loss yr 12'
show_match(match4, df)
show_diff(match3, match4, df)
match5 = '3 pairs in 30 nights trailing loss, SNR=4 yr 12'
show_match(match5, df)
show_diff(match4, match5, df)

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
7,NEO 3 pairs in 15 nights yr 10,60.655279,60.843423,57.718595,62.42445

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
43,NEO 3 pairs in 30 nights yr 10,63.3371,64.176276,61.847965,65.166977

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 30 nights yr 10:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,2.681821,3.332852,4.129371,2.742527,3.221643

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
159,NEO 3 pairs in 15 nights yr 12,NaN,64.9432,61.361651,65.922897

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 15 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,4.099776,3.643056,3.498447,3.747093

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
195,NEO 3 pairs in 30 nights yr 12,NaN,68.108057,65.518469,68.662914

Going from 3 pairs in 15 nights yr 12 to 3 pairs in 30 nights yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,3.164857,4.156818,2.740017,3.353898

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
189,NEO 3 pairs in 30 nights trailing loss yr 12,NaN,68.513862,67.446558,70.357363

Going from 3 pairs in 30 nights yr 12 to 3 pairs in 30 nights trailing loss yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,0.405805,1.928089,1.694449,1.342781

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
192,"NEO 3 pairs in 30 nights trailing loss, SNR=4 ...",NaN,72.199341,71.502199,73.616514

Going from 3 pairs in 30 nights trailing loss yr 12 to 3 pairs in 30 nights trailing loss, SNR=4 yr 12:

,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017,average
0,NaN,3.68548,4.055641,3.259152,3.666758

In [12]:
df = pha_old_df
match2 = '3 pairs in 15 nights yr 10'
show_match(match2, df)
#show_diff(match1, match2, df)
match3 = '3 pairs in 30 nights yr 10'
show_match(match3, df)
show_diff(match2, match3, df)
match4 = '3 pairs in 30 nights trailing loss yr 10'
show_match(match4, df)
show_diff(match3, match4, df)
match5 = '3 pairs in 30 nights trailing loss, SNR=4 yr 10'
show_match(match5, df)
show_diff(match4, match5, df)

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
7,PHA 3 pairs in 15 nights yr 10,74.964997,70.064613,67.029049,72.286809

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
43,PHA 3 pairs in 30 nights yr 10,77.59089,73.124718,71.435025,74.810999

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 30 nights yr 10:

   enigma_1189  enigma_1281  enigma_1282  minion_1016   average
0     2.625893     3.060105     4.405976      2.52419  3.154041

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
31,PHA 3 pairs in 30 nights trailing loss yr 10,78.012546,73.645192,72.167027,75.24956

Going from 3 pairs in 30 nights yr 10 to 3 pairs in 30 nights trailing loss yr 10:

   enigma_1189  enigma_1281  enigma_1282  minion_1016   average
0     0.421656     0.520475     0.732002     0.438562  0.528173

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
37,"PHA 3 pairs in 30 nights trailing loss, SNR=4 ...",80.638334,76.531139,74.686238,77.961248

Going from 3 pairs in 30 nights trailing loss yr 10 to 3 pairs in 30 nights trailing loss, SNR=4 yr 10:

   enigma_1189  enigma_1281  enigma_1282  minion_1016   average
0     2.625788     2.885947     2.519211     2.711687  2.685658

In [13]:
# compare NEO completeness to PHA completeness
def show_two(metadata, df1, df2):
    runnames1 = set(df1.columns.values)
    runnames2 = set(df2.columns.values)
    runnames = runnames1.intersection(runnames2)
    runnames = list(runnames)
    runnames.remove('metadata')
    d = (df2[df2.metadata.str.contains(metadata)][runnames].as_matrix() - 
         df1[df1.metadata.str.contains(metadata)][runnames].as_matrix())
    diff = pd.DataFrame(d, columns=runnames)
    diff['average'] = np.nanmean(d)
    display(diff)

match = '3 pairs in 15 nights yr 10'
df1 = pha_new_df
df2 = neo_new_df
show_match(match, df1)
show_match(match, df2)
show_two(match, df1, df2)

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
19,PHA 3 pairs in 15 nights yr 10,65.55878,66.108125,63.248324,66.50123

,metadata,minion_1016,astro_lsst_01_1016,astro_lsst_01_1015,astro_lsst_01_1017
7,NEO 3 pairs in 15 nights yr 10,60.655279,60.843423,57.718595,62.42445

,minion_1016,astro_lsst_01_1015,astro_lsst_01_1017,astro_lsst_01_1016,average
0,-4.903501,-5.52973,-4.07678,-5.264701,-4.943678

In [14]:
df = neo_old_df
match2 = '3 pairs in 15 nights yr 10'
show_match(match2, df)
#show_diff(match1, match2, df)
match3 = '3 pairs in 30 nights yr 10'
show_match(match3, df)
show_diff(match2, match3, df)
match4 = '3 pairs in 30 nights trailing loss yr 10'
show_match(match4, df)
show_diff(match3, match4, df)
match5 = '3 pairs in 30 nights trailing loss, SNR=4 yr 10'
show_match(match5, df)
show_diff(match4, match5, df)

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
7,NEO 3 pairs in 15 nights yr 10,64.833056,57.851317,54.657858,59.461635

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
43,NEO 3 pairs in 30 nights yr 10,68.361687,61.716776,59.231282,62.424463

Going from 3 pairs in 15 nights yr 10 to 3 pairs in 30 nights yr 10:

   enigma_1189  enigma_1281  enigma_1282  minion_1016   average
0     3.528631     3.865459     4.573424     2.962827  3.732585

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
31,NEO 3 pairs in 30 nights trailing loss yr 10,68.633961,62.327055,59.775857,63.049837

Going from 3 pairs in 30 nights yr 10 to 3 pairs in 30 nights trailing loss yr 10:

   enigma_1189  enigma_1281  enigma_1282  minion_1016   average
0     0.272274     0.610278     0.544575     0.625375  0.513125

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
37,"NEO 3 pairs in 30 nights trailing loss, SNR=4 ...",71.976552,65.42489,62.927365,66.892363

Going from 3 pairs in 30 nights trailing loss yr 10 to 3 pairs in 30 nights trailing loss, SNR=4 yr 10:

   enigma_1189  enigma_1281  enigma_1282  minion_1016   average
0     3.342591     3.097835     3.151508     3.842526  3.358615

In [15]:
df = neo_old_df
match1 = '3 pairs in 15 nights yr 10'
show_match(match1, df)
match2 = '3 pairs in 30 nights yr 10'
show_match(match2, df)
match3 = '3 triplets in 30 nights yr 10'
show_match(match3, df)
match4 = '3 quads in 30 nights yr 10'
show_match(match4, df)
match5 = '3 pairs in 30 nights trailing loss yr 10'
show_match(match5, df)
match6 = '3 pairs in 30 nights trailing loss, SNR=4 yr 10'
show_match(match6, df)

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
7,NEO 3 pairs in 15 nights yr 10,64.833056,57.851317,54.657858,59.461635

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
43,NEO 3 pairs in 30 nights yr 10,68.361687,61.716776,59.231282,62.424463

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
79,NEO 3 triplets in 30 nights yr 10,44.497952,53.290773,52.426873,39.739229

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
61,NEO 3 quads in 30 nights yr 10,31.261804,25.700641,43.548584,27.15548

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
31,NEO 3 pairs in 30 nights trailing loss yr 10,68.633961,62.327055,59.775857,63.049837

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
37,"NEO 3 pairs in 30 nights trailing loss, SNR=4 ...",71.976552,65.42489,62.927365,66.892363

In [16]:
# compare NEO completeness to PHA completeness --- with bad PHA pop
def show_two(metadata, df1, df2):
    runnames1 = set(df1.columns.values)
    runnames2 = set(df2.columns.values)
    runnames = runnames1.intersection(runnames2)
    runnames = list(runnames)
    runnames.remove('metadata')
    d = (df2[df2.metadata.str.contains(metadata)][runnames].as_matrix() - 
         df1[df1.metadata.str.contains(metadata)][runnames].as_matrix())
    diff = pd.DataFrame(d, columns=runnames)
    diff['average'] = np.nanmean(d)
    display(diff)

match = '3 pairs in 15 nights yr 10'
df1 = pha_old_df
df2 = neo_old_df
show_match(match, df1)
show_match(match, df2)
show_two(match, df1, df2)

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
7,PHA 3 pairs in 15 nights yr 10,74.964997,70.064613,67.029049,72.286809

,metadata,enigma_1189,enigma_1281,enigma_1282,minion_1016
7,NEO 3 pairs in 15 nights yr 10,64.833056,57.851317,54.657858,59.461635

   minion_1016  enigma_1281  enigma_1189  enigma_1282  average
0   -12.825174   -12.213296   -10.131942   -12.371191 -11.8854

In [17]:
df = pha_new_df
criteria = ['PHA 3 pairs in 15 nights yr 10', 'PHA 3 pairs in 30 nights yr 10', 'PHA 3 pairs in 30 nights trailing loss yr 10',
            'PHA 3 pairs in 15 nights yr 12', 'PHA 3 pairs in 30 nights yr 12', 
            'PHA 3 pairs in 30 nights trailing loss yr 12', 'PHA 3 pairs in 30 nights trailing loss, SNR=4 yr 12']
c = criteria[0]
d = df.query('metadata == @c')
for c in criteria[1:]:
    d2 = df.query('metadata == @c')
    d = pd.concat([d, d2])
vals = d.columns.values.copy()
vals[0] = 'Discovery Criteria'
d.columns = vals

In [18]:
pd.set_option('max_colwidth', 65)
def float_format(x):
    if np.isnan(x):
        return '--'
    else:
        return '%.1f' %x
pd.set_option('float_format', float_format)
display(HTML(d.to_html(index=False)))

In [19]:
df = neo_new_df
criteria = ['NEO 3 pairs in 15 nights yr 10', 'NEO 3 pairs in 30 nights yr 10', 'NEO 3 pairs in 30 nights trailing loss yr 10',
            'NEO 3 pairs in 15 nights yr 12', 'NEO 3 pairs in 30 nights yr 12', 
            'NEO 3 pairs in 30 nights trailing loss yr 12', 'NEO 3 pairs in 30 nights trailing loss, SNR=4 yr 12']
c = criteria[0]
d = df.query('metadata == @c')
for c in criteria[1:]:
    d2 = df.query('metadata == @c')
    d = pd.concat([d, d2])
vals = d.columns.values.copy()
vals[0] = 'Discovery Criteria'
d.columns = vals

In [20]:
pd.set_option('max_colwidth', 65)
def float_format(x):
    if np.isnan(x):
        return '--'
    else:
        return '%.1f' %x
pd.set_option('float_format', float_format)
display(HTML(d.to_html(index=False)))

In [21]:
df = neo_new_df
criteria = []
for y in xrange(1, 16):
    criteria += ['NEO 3 pairs in 30 nights yr %d' % y]
c = criteria[0]
d = df.query('metadata == @c')
for c in criteria[1:]:
    d2 = df.query('metadata == @c')
    d = pd.concat([d, d2])
vals = d.columns.values.copy()
vals[0] = 'Discovery Criteria'
d.columns = vals

In [22]:
pd.set_option('max_colwidth', 65)
def float_format(x):
    if np.isnan(x):
        return '--'
    else:
        return '%.2f' %x
pd.set_option('float_format', float_format)
display(HTML(d.to_html(index=False)))